Tutoriels/interIsoFoam/debitFranchissement/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interIsoFoam;

startFrom       latestTime; //!!!!!!!!

startTime       0;

stopAt          endTime;

endTime         2000;

deltaT          0.001;

writeControl    adjustable;

writeInterval   20;

purgeWrite      0;

writeFormat     ascii;

writePrecision  7;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.5;

maxAlphaCo      0.15;

maxDeltaT       1.0;

libs
(
    "libbuoyancyModifiedTurbulenceModels.so"
);


// ************************************************************************* //

functions
{

    waterVolume
    {
        type            volFieldValue;
        libs            ("libfieldFunctionObjects.so");
        log             true;

        enabled         true;

        writeControl    adjustableRunTime;
        writeInterval   20;

        writeFields     true;

        regionType      cellZone;
        name            bac;

        operation       volIntegrate;
        fields
        (
            alpha.water
        );

    }
}

