Tutoriels/interIsoFoam/debitFranchissement/constant/waveProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      waveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

inlet
{

    alpha            alpha.water;

    waveModel        irregularMultiDirectional;

    nPaddle          1;

    rampTime         2.0;

    activeAbsorption no;

    wavePeriods
    1000
    (
(2.468260053622327)
(2.4645827529729063)
(2.460916393167147)
(2.4572609254501607)
(2.453616301356314)
(2.4499824727070854)
(2.446359391608943)
(2.44274701045124)
(2.4391452819041293)
(2.4355541589164957)
(2.4319735947139094)
(2.428403542796591)
(2.424843956937403)
(2.4212947911798524)
(2.4177559998361113)
(2.4142275374850612)
(2.4107093589703443)
(2.407201419398441)
(2.4037036741367572)
(2.400216078811735)
(2.3967385893069735)
(2.3932711617613696)
(2.3898137525672736)
(2.386366318368661)
(2.3829288160593207)
(2.3795012027810594)
(2.3760834359219167)
(2.3726754731144037)
(2.3692772722337487)
(2.3658887913961646)
(2.362509988957126)
(2.359140823509664)
(2.355781253882674)
(2.35243123913924)
(2.3490907385749704)
(2.345759711716351)
(2.342438118319108)
(2.339125918366589)
(2.3358230720681576)
(2.332529539857595)
(2.329245282391526)
(2.325970260547847)
(2.3227044354241775)
(2.3194477683363153)
(2.316200220816712)
(2.312961754612958)
(2.309732331686279)
(2.306511914210048)
(2.30330046456831)
(2.3000979453543127)
(2.2969043193690593)
(2.2937195496198637)
(2.2905435993189265)
(2.287376431881915)
(2.284218010926561)
(2.2810683002712655)
(2.277927263933718)
(2.274794866129527)
(2.2716710712708608)
(2.2685558439650975)
(2.2654491490134925)
(2.262350951409849)
(2.2592612163392056)
(2.2561799091765304)
(2.253106995485429)
(2.2500424410168613)
(2.2469862117078687)
(2.2439382736803113)
(2.240898593239619)
(2.2378671368735463)
(2.234843871250942)
(2.23182876322053)
(2.2288217798096928)
(2.225822888223275)
(2.2228320558423853)
(2.219849250223219)
(2.216874439095882)
(2.213907590363228)
(2.2109486720997027)
(2.207997652550202)
(2.205054500128931)
(2.2021191834182816)
(2.199191671167713)
(2.1962719322926416)
(2.1933599358733424)
(2.1904556511538558)
(2.1875590475409075)
(2.184670094602831)
(2.1817887620685044)
(2.178915019826292)
(2.1760488379229956)
(2.173190186562813)
(2.1703390361063084)
(2.1674953570693822)
(2.1646591201222627)
(2.161830296088489)
(2.1590088559439184)
(2.156194770815729)
...
    );

    waveHeights
    1000
    (
(0.002400396103713195)
(0.002424822405030631)
(0.0024492590580374)
(0.0024737036108598816)
(0.0024981536274085504)
(0.0025226066878686333)
(0.002547060389175591)
(0.002571512345475698)
(0.0025959601885716605)
(0.0026204015683534776)
(0.002644834153214602)
(0.002669255630453584)
(0.0026936637066612085)
(0.002718056108093424)
(0.0027424305810300116)
(0.0027667848921193116)
(0.0027911168287090187)
(0.0028154241991632874)
(0.002839704833166262)
(0.002863956582012185)
(0.002888177318882291)
(0.002912364939108634)
(0.0029365173604249855)
(0.002960632523205027)
(0.002984708390688013)
(0.003008742949192039)
(0.003032734208315178)
(0.003056680201124555)
(0.003080578984333706)
(0.003104428638468234)
(0.0031282272680201112)
(0.0031519730015907134)
(0.0031756639920228424)
(0.0031992984165218866)
(0.003222874476766376)
(0.0032463903990080454)
(0.0032698444341617053)
(0.0032932348578850077)
(0.003316559970648417)
(0.003339818097795503)
(0.003363007589593765)
(0.0033861268212762577)
(0.0034091741930740898)
(0.0034321481302401415)
(0.003455047083064061)
(0.0034778695268788385)
(0.0035006139620590844)
(0.003523278914011261)
(0.0035458629331560107)
(0.0035683645949028306)
(0.00359078249961721)
(0.0036131152725805147)
(0.003635361563942703)
(0.0036575200486681607)
(0.003679589426474783)
(0.0037015684217664604)
(0.0037234557835592397)
(0.003745250285401291)
(0.003766950725286807)
(0.0037885559255641217)
(0.0038100647328381397)
(0.0038314760178672644)
(0.003852788675455064)
(0.003874001624336694)
(0.0038951138070604514)
(0.0039161241898644)
(0.003937031762548433)
(0.003957835538341784)
(0.003978534553766236)
(0.003999127868495113)
(0.00401961456520831)
(0.004039993749443358)
(0.004060264549442865)
(0.004080426115998285)
(0.004100477622290324)
(0.0041204182637260165)
(0.004140247257772644)
(0.004159963843788678)
(0.004179567282851791)
(0.004199056857584161)
(0.004218431871975134)
(0.004237691651201413)
(0.00425683554144484)
(0.0042758629097080225)
(0.004294773143627722)
(0.004313565651286354)
(0.004332239861021496)
(0.004350795221233713)
(0.004369231200192642)
(0.0043875472858415756)
(0.004405742985600576)
(0.004423817826168224)
(0.004441771353322163)
(0.00445960313171849)
(0.004477312744690069)
(0.004494899794043928)
(0.004512363899857789)
(0.0045297047002758085)
...
    );

    wavePhases
    1000
    (
(2.221042458128572)
(1.7426842488590986)
(5.067352409372015)
(5.675008666716417)
(3.9486385715492)
(5.482072159604862)
(5.345380645902386)
(1.1579719395105892)
(0.6203140368999096)
(3.6613496099010865)
(5.242303253851466)
(3.443472826747437)
(3.353137346354172)
(4.65598226698604)
(5.5877912312352)
(0.5796961481914032)
(5.419654178166025)
(0.15740444207632104)
(2.272815192483588)
(4.926201975896439)
(2.666224909711332)
(3.9002209601748796)
(0.5687361423409929)
(3.147002157283446)
(3.9863031549097374)
(0.7115683498566138)
(3.6097631221242494)
(2.9297716386229844)
(4.306038880649021)
(1.7561805465291398)
(5.3726325505415)
(6.134723039453939)
(6.034932366062214)
(1.6419432416609894)
(4.822460168803978)
(4.2088499295380055)
(5.8878972298172965)
(2.742727974382732)
(5.7086664863457655)
(2.0526808611129983)
(1.0390770998304462)
(4.42825413310821)
(0.46384080503825437)
(1.005815708353226)
(2.8090660880487484)
(5.748732015148612)
(5.064447786676383)
(5.851521597802355)
(6.121738359204966)
(1.3610490625259226)
(5.0811370733011)
(0.5133247246413107)
(2.821926317583885)
(5.565170099591243)
(3.5828019254921375)
(3.3380442277068103)
(2.684667343673999)
(0.0812117461011989)
(5.151028310371472)
(5.428416771978703)
(1.1873359494300666)
(0.22466904360555667)
(4.679170784652412)
(1.2615465682047442)
(0.852537021984497)
(3.9926049019968146)
(3.1158758484053775)
(2.1053145461318192)
(5.571200545930789)
(3.3932689214800473)
(5.192491898700155)
(4.530334523959335)
(2.9651035533341332)
(3.29777973898306)
(0.3662140571367231)
(5.312136707417415)
(1.0712625089023773)
(1.2496854798212538)
(5.216940118423343)
(0.9771461151821575)
(3.4551974860861185)
(1.1532905652361838)
(4.519124888569065)
(1.65613545023433)
(0.11702341886829136)
(0.8674082763082839)
(0.5986302669917762)
(4.692212680835766)
(2.711960134936887)
(0.8645547986618475)
(4.232795329183595)
(5.602517144328542)
(1.4618312784039462)
(5.2208590064433595)
(2.130050304775849)
(1.4139922601126864)
(0.5082063387613117)
(5.1910194036059805)
...
    );

    waveDirs
    1000
    (
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
...
    );

}

outlet
{

    alpha            alpha.water;

    waveModel        shallowWaterAbsorption;

    nPaddle          1;
}
