Tutoriels/interIsoFoam/debitFranchissement/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.0001;

boundaryField
{
    "(actuel2|bottom|outlet)"
    {
        type            epsilonWallFunction;
        value           $internalField;
    }

    inlet
    {
        type            inletOutlet;
        inletValue      $internalField;
	value		$internalField;
    }

    top
    {
	type		inletOutlet;
	inletValue	$internalField;
	value		$internalField;
    }

    front
    {
	type 		empty;
    }

    back
    {
        type            empty;
    }
}


// ************************************************************************* //
