Tutoriels/interIsoFoam/debitFranchissement/Allrun.case.parallel
#!/bin/bash

# Lancer le maillage
Allmesh -peSc

# Générer la houle irrégulière
genHouleIrreguliere

# Lancer le calcul. L'option -s lance setFields
Allrun -spt &

# Attendre 5 secondes avant de lancer le monitoring
sleep 5

# Suivre la progression du calcul et lancer le calcul de débits de franchissement
# lorsque terminé
AllpostProcess debitFranchissement.py
