Tutoriels/interIsoFoam/debitFranchissement/Allrun.case.serial
#!/bin/bash

# Lancer le maillage
Allmesh -eSc

# Générer la houle irrégulière
genHouleIrreguliere

# Lancer le calcul. L'option -s lance setFields
Allrun -st &

# Attendre 5 secondes avant de lancer le monitoring
sleep 5

# Suivre la progression du calcul et lancer le calcul de débits de franchissement
# lorsque terminé
AllpostProcess debitFranchissement.py
